Revit 2024 API
TessellatedFace Constructor
Overload List
Name | Description
TessellatedFace(IList<XYZ>, ElementId)
 Constructs a tessellated face without holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible.
TessellatedFace(IList<IList<XYZ>>, ElementId)
 Constructs a tessellated face, which, may be, have holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible.
See Also
TessellatedFace Class
TessellatedFace Members
Autodesk.Revit.DB Namespace